In [1]:
import numpy as np
import pandas as pd

In [2]:
np.random.normal?

In [4]:
a = np.array([3,1,10,7])
b = pd.Series(a)

In [5]:
b.sort_values

<bound method Series.sort_values of 0     3
1     1
2    10
3     7
dtype: int64>

In [6]:
b

0     3
1     1
2    10
3     7
dtype: int64

In [12]:
b.sort_values().index

Int64Index([1, 0, 3, 2], dtype='int64')

In [13]:
b = b.sort_values()

In [14]:
b

1     1
0     3
3     7
2    10
dtype: int64

In [15]:
c = b.index

In [16]:
c

Int64Index([1, 0, 3, 2], dtype='int64')

In [41]:
d = np.array([[1,2,3],[2,3,4],[3,4,5],[4,5,6]])

In [42]:
d = pd.DataFrame(d)

In [43]:
d

   0  1  2
0  1  2  3
1  2  3  4
2  3  4  5
3  4  5  6

In [45]:
d.reindex(c)

   0  1  2
1  2  3  4
0  1  2  3
3  4  5  6
2  3  4  5

In [46]:
d

   0  1  2
0  1  2  3
1  2  3  4
2  3  4  5
3  4  5  6

In [47]:
e = d[1]

In [48]:
e

0    2
1    3
2    4
3    5
Name: 1, dtype: int64

In [49]:
d = d.reindex(c)

In [50]:
d

   0  1  2
1  2  3  4
0  1  2  3
3  4  5  6
2  3  4  5

In [51]:
d.index = np.arange(4)

In [52]:
d

   0  1  2
0  2  3  4
1  1  2  3
2  4  5  6
3  3  4  5

In [53]:
d[2][1]

3